[
  {
    "NL Question": "How many films are in the graph?",
    "Cypher": "MATCH (f:Film) RETURN count(f)",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_1_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 506,
    "unique_id": "star_wars_data_3_1_2_6_Simple_Aggregation_506",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the average cargo capacity of all starships?",
    "Cypher": "MATCH (s:Starship) WHERE s.cargo_capacity <> 'unknown' RETURN avg(toFloat(s.cargo_capacity))",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_1_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 507,
    "unique_id": "star_wars_data_3_1_2_6_Simple_Aggregation_507",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "How many characters in the database have a known mass?",
    "Cypher": "MATCH (c:Character) WHERE c.mass <> 'unknown' RETURN count(c) AS numberOfCharactersWithKnownMass;",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_1_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 519,
    "unique_id": "star_wars_data_3_1_2_6_Simple_Aggregation_519",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the maximum length among all the starships?",
    "Cypher": "MATCH (s:Starship) WHERE s.length <> 'unknown' RETURN max(toFloat(s.length)) AS maxLength;",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_1_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 520,
    "unique_id": "star_wars_data_3_1_2_6_Simple_Aggregation_520",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the minimum cost in credits among all vehicles?",
    "Cypher": "MATCH (v:Vehicle) WHERE v.cost_in_credits <> 'unknown' RETURN min(toFloat(v.cost_in_credits)) AS minCostInCredits;",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_1_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 521,
    "unique_id": "star_wars_data_3_1_2_6_Simple_Aggregation_521",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the average height of all 'Gungan' species?",
    "Cypher": "MATCH (s:Species) WHERE s.name = 'Gungan' RETURN avg(toFloat(s.average_height))",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_1_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 526,
    "unique_id": "star_wars_data_3_1_2_6_Simple_Aggregation_526",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the average length of all 'Starship'?",
    "Cypher": "MATCH (s:Starship) RETURN avg(toFloat(s.length))",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_1_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 528,
    "unique_id": "star_wars_data_3_1_2_6_Simple_Aggregation_528",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the total number of characters whose eye color is blue?",
    "Cypher": "MATCH (c:Character) WHERE c.eye_color = 'blue' RETURN count(c)",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_1_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 535,
    "unique_id": "star_wars_data_3_1_2_6_Simple_Aggregation_535",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "How many species have an average lifespan greater than 80 years?",
    "Cypher": "MATCH (s:Species) WHERE toInteger(s.average_lifespan) > 80 RETURN count(s)",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_1_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 536,
    "unique_id": "star_wars_data_3_1_2_6_Simple_Aggregation_536",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "How many characters have an eye color of brown?",
    "Cypher": "MATCH (c:Character) WHERE c.eye_color = 'brown' RETURN count(c)",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_1_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 548,
    "unique_id": "star_wars_data_3_1_2_6_Simple_Aggregation_548",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the average diameter of planets with a known diameter size?",
    "Cypher": "MATCH (p:Planet) WHERE p.diameter <> 'unknown' RETURN avg(toFloat(p.diameter)) AS AveragePlanetDiameter",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 1,
    "unique_id": "star_wars_data_3_2_2_6_Simple_Aggregation_1",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "How many starships have a crew size greater than 1?",
    "Cypher": "MATCH (s:Starship) WHERE toInteger(s.crew) > 1 RETURN count(s) AS NumberOfStarshipsWithCrewGreaterThanOne",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 2,
    "unique_id": "star_wars_data_3_2_2_6_Simple_Aggregation_2",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the minimum cost in credits among all vehicles with a known cost?",
    "Cypher": "MATCH (v:Vehicle) WHERE v.cost_in_credits <> 'unknown' RETURN min(toFloat(v.cost_in_credits)) AS MinimumVehicleCost",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 3,
    "unique_id": "star_wars_data_3_2_2_6_Simple_Aggregation_3",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the average diameter of planets in the database?",
    "Cypher": "MATCH (p:Planet) RETURN avg(toInteger(p.diameter))",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 15,
    "unique_id": "star_wars_data_3_2_2_6_Simple_Aggregation_15",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "How many starships have an 'unknown' cargo capacity?",
    "Cypher": "MATCH (s:Starship) WHERE s.cargo_capacity = 'unknown' RETURN count(s)",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 16,
    "unique_id": "star_wars_data_3_2_2_6_Simple_Aggregation_16",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "How many planets have a terrain listed as 'desert'?",
    "Cypher": "MATCH (p:Planet) WHERE p.terrain = 'desert' RETURN count(p)",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 42,
    "unique_id": "star_wars_data_3_2_2_6_Simple_Aggregation_42",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the average 'orbital_period' of planets with a 'temperate' climate?",
    "Cypher": "MATCH (p:Planet) WHERE p.climate = 'temperate' RETURN avg(toFloat(p.orbital_period))",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 45,
    "unique_id": "star_wars_data_3_2_2_6_Simple_Aggregation_45",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "How many starships have a 'crew' size greater than 5?",
    "Cypher": "MATCH (s:Starship) WHERE s.crew <> 'unknown' AND toInteger(s.crew) > 5 RETURN count(s)",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 46,
    "unique_id": "star_wars_data_3_2_2_6_Simple_Aggregation_46",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the average length of Starships for which the length is known?",
    "Cypher": "MATCH (s:Starship) WHERE s.length <> 'unknown' RETURN avg(toFloat(s.length))",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 57,
    "unique_id": "star_wars_data_3_2_2_6_Simple_Aggregation_57",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "How many species have an average lifespan listed as 'unknown'?",
    "Cypher": "MATCH (s:Species) WHERE s.average_lifespan = 'unknown' RETURN COUNT(s) AS NumberOfSpeciesWithUnknownLifespan",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 67,
    "unique_id": "star_wars_data_3_2_2_6_Simple_Aggregation_67",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the maximum atmospheric speed among all vehicles?",
    "Cypher": "MATCH (v:Vehicle) WHERE v.max_atmosphering_speed <> 'unknown' RETURN max(toFloat(v.max_atmosphering_speed)) AS maxVehicleSpeed",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 73,
    "unique_id": "star_wars_data_3_2_2_6_Simple_Aggregation_73",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "How many characters have 'n/a' hair color?",
    "Cypher": "MATCH (c:Character) WHERE c.hair_color = 'n/a' RETURN count(c)",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 79,
    "unique_id": "star_wars_data_3_2_2_6_Simple_Aggregation_79",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "How many planets have a terrain that includes 'ocean'?",
    "Cypher": "MATCH (p:Planet) WHERE p.terrain CONTAINS 'ocean' RETURN count(p)",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 98,
    "unique_id": "star_wars_data_3_2_2_6_Simple_Aggregation_98",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the average height of species whose designation is 'sentient'?",
    "Cypher": "MATCH (s:Species) WHERE s.designation = 'sentient' RETURN avg(toFloat(s.average_height))",
    "source_dataset": "star_wars",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 99,
    "unique_id": "star_wars_data_3_2_2_6_Simple_Aggregation_99",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  }
]