[
  {
    "NL Question": "What is the type of the Point of Interest named 'Great Lawn Ball Field 5'?",
    "Cypher": "MATCH (p:PointOfInterest {name: 'Great Lawn Ball Field 5'}) RETURN p.type AS POIType;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 137,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_137",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the version of the OSM node with osm ID 1382339069?",
    "Cypher": "MATCH (n:OSMNode {node_osm_id: 1382339069}) RETURN n.version AS OSMNodeVersion",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 140,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_140",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the OSM Relation with relation ID 9712348?",
    "Cypher": "MATCH (r:OSMRelation {relation_osm_id: 9712348}) RETURN r.name AS OSMRelationName",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 141,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_141",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the timestamp of the Point of Interest named 'José de San Martín'?",
    "Cypher": "MATCH (p:PointOfInterest {name: 'José de San Martín'}) RETURN p.timestamp AS PointOfInterestTimestamp",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 142,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_142",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the generator used in the OSM data with name '/Users/lyonwj/filtered.osm.bz2'?",
    "Cypher": "MATCH (o:OSM {name: '/Users/lyonwj/filtered.osm.bz2'}) RETURN o.generator AS OSMGenerator",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 143,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_143",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the version of the OSMWay node with way_osm_id 587256613?",
    "Cypher": "MATCH (w:OSMWay {way_osm_id: 587256613}) RETURN w.version AS WayVersion;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 148,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_148",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the PointOfInterest node with node_osm_id 5618087856?",
    "Cypher": "MATCH (p:PointOfInterest {node_osm_id: 5618087856}) RETURN p.name AS PointOfInterestName;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 149,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_149",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the timestamp of the OSMNode with a 'node_osm_id' of 1732075116?",
    "Cypher": "MATCH (n:OSMNode {node_osm_id: 1732075116}) RETURN n.timestamp AS NodeTimestamp;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 156,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_156",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the 'highway' tag value associated with the OSMTags node that also has a 'surface' tag value of 'asphalt' and 'name' tag value of 'Terrace Drive'?",
    "Cypher": "MATCH (t:OSMTags {surface: 'asphalt', name: 'Terrace Drive'}) RETURN t.highway AS HighwayTag;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 157,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_157",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the version of the OSMWay with 'way_osm_id' equal to 386475138?",
    "Cypher": "MATCH (w:OSMWay {way_osm_id: 386475138}) RETURN w.version AS WayVersion;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 158,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_158",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the 'origin' property of the Bounds node where 'minlat' is '40.76430'?",
    "Cypher": "MATCH (b:Bounds {minlat: '40.76430'}) RETURN b.origin AS origin;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 162,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_162",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the 'amenity' property of the OSMTags node?",
    "Cypher": "MATCH (t:OSMTags) RETURN t.amenity AS amenity;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 163,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_163",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the timestamp of the OSMNode with node_osm_id equal to 1732074899?",
    "Cypher": "MATCH (n:OSMNode {node_osm_id: 1732074899}) RETURN n.timestamp AS timestamp;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 164,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_164",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the 'name' property of the PointOfInterest node with the type 'bicycle rental'?",
    "Cypher": "MATCH (p:PointOfInterest {type: 'bicycle rental'}) RETURN p.name AS name;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 165,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_165",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the highway tag value associated with the OSMWay that has way_osm_id equal to 426502674?",
    "Cypher": "MATCH (w:OSMWay {way_osm_id: 426502674}) RETURN w.highway AS HighwayTagValue;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 170,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_170",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the OSMRelation with relation_osm_id equal to 2632940?",
    "Cypher": "MATCH (r:OSMRelation {relation_osm_id: 2632940}) RETURN r.name AS RelationName;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 171,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_171",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the type property of the PointOfInterest node named 'pitch' and having a longitude of -73.9611813?",
    "Cypher": "MATCH (p:PointOfInterest {name: 'pitch', lon: -73.9611813}) RETURN p.type AS PointOfInterestType;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 172,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_172",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the version of the OSM node with node_osm_id 6835789285?",
    "Cypher": "MATCH (n:OSMNode {node_osm_id: 6835789285}) RETURN n.version AS OSMNodeVersion;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 175,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_175",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the highway tag value associated with the OSMWay having way_osm_id 426140891?",
    "Cypher": "MATCH (w:OSMWay {way_osm_id: 426140891})-[r:TAGS]->(t:OSMTags) RETURN t.highway AS HighwayTag;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 176,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_176",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the OSMRelation with relation_osm_id 9727210?",
    "Cypher": "MATCH (r:OSMRelation {relation_osm_id: 9727210}) RETURN r.name AS RelationName;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 178,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_178",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the version of the OSM file named '/Users/lyonwj/filtered.osm.bz2'?",
    "Cypher": "MATCH (o:OSM {name: '/Users/lyonwj/filtered.osm.bz2'}) RETURN o.version AS OSMFileVersion;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 179,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_179",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the version of the OSM node with node_osm_id 2562438657?",
    "Cypher": "MATCH (n:OSMNode {node_osm_id: 2562438657}) RETURN n.version AS OSMNodeVersion;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 182,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_182",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the OSM relation with relation_osm_id 7575713?",
    "Cypher": "MATCH (r:OSMRelation {relation_osm_id: 7575713}) RETURN r.name AS OSMRelationName;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 183,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_183",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the PointOfInterest node with node_osm_id 3915228832?",
    "Cypher": "MATCH (p:PointOfInterest {node_osm_id: 3915228832}) RETURN p.name AS PointOfInterestName;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 186,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_186",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the version of the OSM node with node_osm_id 5075030732?",
    "Cypher": "MATCH (n:OSMNode {node_osm_id: 5075030732}) RETURN n.version AS Version",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 189,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_189",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the OSM relation with relation_osm_id 10460964?",
    "Cypher": "MATCH (r:OSMRelation {relation_osm_id: 10460964}) RETURN r.name AS RelationName",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 190,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_190",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the highway tag value of the OSM way with way_osm_id 719105678?",
    "Cypher": "MATCH (w:OSMWay {way_osm_id: 719105678}) RETURN w.highway AS HighwayTag",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 191,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_191",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the minimum latitude ('minlat') specified in the Bounds associated with the OSM data?",
    "Cypher": "MATCH (o:OSM)-[:BBOX]->(b:Bounds) RETURN b.minlat AS MinimumLatitude;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 197,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_197",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the timestamp of the OSMNode with node_osm_id equal to 30807350?",
    "Cypher": "MATCH (n:OSMNode {node_osm_id: 30807350}) RETURN n.timestamp AS NodeTimestamp;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 198,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_198",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the highway tag value associated with the OSMWay that has way_osm_id equal to 318474879?",
    "Cypher": "MATCH (w:OSMWay {way_osm_id: 318474879})-[:TAGS]->(t:OSMTags) RETURN t.highway AS HighwayTagValue;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 199,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_199",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the OSMRelation with relation_osm_id equal to 9712344?",
    "Cypher": "MATCH (r:OSMRelation {relation_osm_id: 9712344}) RETURN r.name AS RelationName;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 200,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_200",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the amenity type of the OSMTags associated with recycling and recycling_type as container?",
    "Cypher": "MATCH (t:OSMTags {recycling_type: 'container', amenity: 'recycling'}) RETURN t.amenity AS AmenityType;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 205,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_205",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the OSMRelation with relation_osm_id equal to 9663806?",
    "Cypher": "MATCH (r:OSMRelation {relation_osm_id: 9663806}) RETURN r.name AS RelationName;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 206,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_206",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the 'highway' tag value for the OSMWay with way_osm_id equal to 318474831?",
    "Cypher": "MATCH (w:OSMWay {way_osm_id: 318474831}) RETURN w.highway AS HighwayType;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 207,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_207",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the timestamp of the OSMNode with node_osm_id 4256629093?",
    "Cypher": "MATCH (n:OSMNode {node_osm_id: 4256629093}) RETURN n.timestamp AS nodeTimestamp;",
    "source_dataset": "osm",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 212,
    "unique_id": "osm_data_3_3_2_6_Evaluation_query_212",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  }
]