[
  {
    "NL Question": "Find the name of the committee that Legislator Martha McSally serves on and their jurisdiction.",
    "Cypher": "MATCH (l:Legislator {firstName: 'Martha', lastName: 'McSally'})-[:SERVES_ON]->(c:Committee) RETURN c.name AS CommitteeName, c.jurisdiction AS CommitteeJurisdiction",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 46,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_46",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the full name of the legislator with the bioguideID 'L000576'?",
    "Cypher": "MATCH (l:Legislator {bioguideID: 'L000576'}) RETURN l.firstName, l.lastName",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 49,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_49",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What party does the legislator with the govtrackID '412445' belong to?",
    "Cypher": "MATCH (l:Legislator {govtrackID: '412445'}) RETURN l.party",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 50,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_50",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the official title of the bill with the billID 's2304-114'?",
    "Cypher": "MATCH (b:Bill {billID: 's2304-114'}) RETURN b.officialTitle",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 51,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_51",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the type of the body that legislators can be ELECTED_TO?",
    "Cypher": "MATCH (l:Legislator)-[:ELECTED_TO]->(b:Body) RETURN b.type",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 52,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_52",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the party that Glenn Thompson is IS_MEMBER_OF?",
    "Cypher": "MATCH (l:Legislator {firstName: 'Glenn', lastName: 'Thompson'})-[:IS_MEMBER_OF]->(p:Party) RETURN p.name",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 53,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_53",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the current party affiliation of the legislator named Bill Foster?",
    "Cypher": "MATCH (l:Legislator {firstName: 'Bill', lastName: 'Foster'}) RETURN l.currentParty AS CurrentParty;",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 56,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_56",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the type of body that Julia Brownley is elected to?",
    "Cypher": "MATCH (l:Legislator {firstName: 'Julia', lastName: 'Brownley'})-[:ELECTED_TO]->(b:Body) RETURN b.type AS BodyType;",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 57,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_57",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the official title of the bill with the bill ID 's2106-114'?",
    "Cypher": "MATCH (b:Bill {billID: 's2106-114'}) RETURN b.officialTitle AS OfficialTitle;",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 58,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_58",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the party that Louise Slaughter is a member of?",
    "Cypher": "MATCH (l:Legislator {firstName: 'Louise', lastName: 'Slaughter'})-[:IS_MEMBER_OF]->(p:Party) RETURN p.name AS PartyName;",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 59,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_59",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the code of the state that Mike Lee represents?",
    "Cypher": "MATCH (l:Legislator {firstName: 'Mike', lastName: 'Lee'})-[:REPRESENTS]->(s:State) RETURN s.code AS StateCode;",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 60,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_60",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What are the names of all the political parties in the graph?",
    "Cypher": "MATCH (p:Party) RETURN p.name AS PartyName",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 64,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_64",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the full name of the legislator with the bioguideID 'S001195'?",
    "Cypher": "MATCH (l:Legislator {bioguideID: 'S001195'}) RETURN l.firstName, l.lastName",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 70,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_70",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What party does the legislator with the govtrackID '412596' belong to?",
    "Cypher": "MATCH (l:Legislator {govtrackID: '412596'}) RETURN l.party",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 71,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_71",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the official title of the bill with the billID 'hr1926-114'?",
    "Cypher": "MATCH (b:Bill {billID: 'hr1926-114'}) RETURN b.officialTitle",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 72,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_72",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the type of the body that legislator Joaquin Castro elected to?",
    "Cypher": "MATCH (l:Legislator {firstName: 'Joaquin', lastName: 'Castro'})-[:ELECTED_TO]->(b:Body) RETURN b.type",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 73,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_73",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the committee that legislator Doug LaMalfa serves on?",
    "Cypher": "MATCH (l:Legislator {firstName: 'Doug', lastName: 'LaMalfa'})-[:SERVES_ON]->(c:Committee) RETURN c.name",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 74,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_74",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "Retrieve the bioguide ID and first name of the legislator whose last name is Yarmuth.",
    "Cypher": "MATCH (l:Legislator {lastName: 'Yarmuth'}) RETURN l.bioguideID, l.firstName",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 77,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_77",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "Find the names of all parties in the graph.",
    "Cypher": "MATCH (p:Party) RETURN p.name",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 78,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_78",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the official title of the bill with the bill ID hr4467-114?",
    "Cypher": "MATCH (b:Bill {billID: 'hr4467-114'}) RETURN b.officialTitle",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 79,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_79",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "Retrieve the type of body that is named 'Senate'.",
    "Cypher": "MATCH (b:Body {type: 'Senate'}) RETURN b.type",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 80,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_80",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the code of the state represented by Keith Ellison?",
    "Cypher": "MATCH (l:Legislator {firstName: 'Keith', lastName: 'Ellison'})-[:REPRESENTS]->(s:State) RETURN s.code",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 81,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_81",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the type of the legislative body that David Rouzer is elected to?",
    "Cypher": "MATCH (l:Legislator {firstName: 'David', lastName: 'Rouzer'})-[:ELECTED_TO]->(b:Body) RETURN b.type",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 84,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_84",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the party affiliation of legislator Justin Amash?",
    "Cypher": "MATCH (l:Legislator {firstName: 'Justin', lastName: 'Amash'}) RETURN l.party",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 85,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_85",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the official title of the bill with bill ID 's2951-114'?",
    "Cypher": "MATCH (b:Bill {billID: 's2951-114'}) RETURN b.officialTitle",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 86,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_86",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the committee that has the thomasID 'SSGA'?",
    "Cypher": "MATCH (c:Committee {thomasID: 'SSGA'}) RETURN c.name",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 87,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_87",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "Which subject does the bill with billID 'hr283-114' deal with?",
    "Cypher": "MATCH (b:Bill {billID: 'hr283-114'})-[:DEALS_WITH]->(s:Subject) RETURN s.title",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 88,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_88",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the current party affiliation of the legislator with the bioguide ID 'C001106'?",
    "Cypher": "MATCH (l:Legislator {bioguideID: 'C001106'}) RETURN l.currentParty AS CurrentParty;",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 91,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_91",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the official title of the bill with the ID 's1684-114'?",
    "Cypher": "MATCH (b:Bill {billID: 's1684-114'}) RETURN b.officialTitle AS OfficialTitle;",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 92,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_92",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the party that legislator with bioguideID 'H001067' is a member of?",
    "Cypher": "MATCH (l:Legislator {bioguideID: 'H001067'})-[:IS_MEMBER_OF]->(p:Party) RETURN p.name AS PartyName;",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 93,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_93",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the type of body that legislator with bioguideID 'G000582' was elected to?",
    "Cypher": "MATCH (l:Legislator {bioguideID: 'G000582'})-[:ELECTED_TO]->(b:Body) RETURN b.type AS BodyType;",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 94,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_94",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the name of the committee that the legislator with bioguideID 'T000467' serves on, with a rank of 5?",
    "Cypher": "MATCH (l:Legislator {bioguideID: 'T000467'})-[r:SERVES_ON]->(c:Committee) WHERE r.rank = 5 RETURN c.name AS CommitteeName;",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 95,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_95",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "Find the bill with the billID 'hr3905-114' and return its official title.",
    "Cypher": "MATCH (b:Bill {billID: 'hr3905-114'}) RETURN b.officialTitle",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 99,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_99",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the party affiliation of the legislator with the bioguideID 'A000369'?",
    "Cypher": "MATCH (l:Legislator {bioguideID: 'A000369'}) RETURN l.party",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 100,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_100",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "List all legislators who represent the state with code 'MN'.",
    "Cypher": "MATCH (l:Legislator)-[:REPRESENTS]->(s:State {code: 'MN'}) RETURN l",
    "source_dataset": "legis_graph",
    "source_chunk": "data_2_2_2_6",
    "original_file": "Simple_Retrieval.json",
    "original_index": 101,
    "unique_id": "legis_graph_data_2_2_2_6_Simple_Retrieval_101",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  }
]