[
  {
    "NL Question": "What is the total number of players who represent the team 'China PR'?",
    "Cypher": "MATCH (p:Person)-[:REPRESENTS]->(t:Team {name: 'China PR'}) RETURN COUNT(p) AS totalPlayers",
    "source_dataset": "wwc",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 165,
    "unique_id": "wwc_data_3_3_2_6_Simple_Aggregation_165",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the total number of people who are coaches for squads?",
    "Cypher": "MATCH (p:Person)-[:COACH_FOR]->(s:Squad) RETURN COUNT(DISTINCT p) AS totalCoaches;",
    "source_dataset": "wwc",
    "source_chunk": "data_3_3_2_6",
    "original_file": "Simple_Aggregation.json",
    "original_index": 169,
    "unique_id": "wwc_data_3_3_2_6_Simple_Aggregation_169",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  }
]