{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json \n",
    "import os \n",
    "import requests\n",
    "from dataclasses import dataclass\n",
    "from typing import Dict, List\n",
    "from neo4j import GraphDatabase\n",
    "from utils.utilities import *\n",
    "from utils.neo4j_conn import *\n",
    "from utils.neo4j_schema import *\n",
    "from utils.graph_utils import *\n",
    "\n",
    "@dataclass\n",
    "class Config:\n",
    "    neo4j_uri: str = \"neo4j+s://4017a08b.databases.neo4j.io\"\n",
    "    neo4j_user: str = \"neo4j\"\n",
    "    neo4j_password: str = \"NMa5reBMrNMfIJvMFLKy6lsnKqYQR_q4EajPYzH8pQk\"\n",
    "    groq_api_key: str = \"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\"\n",
    "    database: str = \"neo4j\"\n",
    "    \n",
    "    @property\n",
    "    def groq_headers(self) -> Dict:\n",
    "        return {\n",
    "            \"Authorization\": f\"Bearer {self.groq_api_key}\",\n",
    "            \"Content-Type\": \"application/json\"\n",
    "        }"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Here are the 20 generated questions, along with their reasoning and Cypher statements:\n",
      "Cypher: `MATCH (c:Case {primaryid: 10})-[:IS_PRIMARY_SUSPECT]->(d:Drug) RETURN d.name`\n",
      "Cypher: `MATCH (c:Case {primaryid: 107526832})-[:FALLS_UNDER]->(ag:AgeGroup) RETURN ag.ageGroup`\n",
      "Cypher: `MATCH (c:Case {primaryid: 109543792}) RETURN c.reporterOccupation`\n",
      "Cypher: `MATCH (c:Case {primaryid: 172775763})-[:RESULTED_IN]->(o:Outcome) RETURN o.outcome`\n",
      "Cypher: `MATCH (m:Manufacturer)-[:REGISTERED]->(c:Case {primaryid: 135402785}) RETURN m.manufacturerName`\n",
      "Cypher: `MATCH (c:Case {primaryid: 172775763})-[:IS_PRIMARY_SUSPECT]->(d:Drug {name: 'DEXAMETHASONE'}) RETURN d.doseAmount`\n",
      "Cypher: `MATCH (d:Drug {id: 7160})-[:IS_SECONDARY_SUSPECT]->(c:Case) RETURN c.primaryid`\n",
      "Cypher: `MATCH (c:Case {primaryid: 1376832112})-[:IS_SECONDARY_SUSPECT]->(d:Drug {name: 'AFINITOR'}) RETURN d.route`\n",
      "Cypher: `MATCH (c:Case {primaryid: 172652664}) RETURN c.age`\n",
      "Cypher: `MATCH (c:Case {primaryid: 172652664})-[:HAS_REACTION]->(r:Reaction) RETURN r.description`\n",
      "Cypher: `MATCH (c:Case {primaryid: 109705882})-[:RECEIVED]->(t:Therapy) RETURN t.primaryid`\n",
      "Cypher: `MATCH (c:Case {primaryid: 104833856})-[:REPORTED_BY]->(rs:ReportSource) RETURN rs.name`\n",
      "Cypher: `MATCH (c:Case {primaryid: 168021028})-[:IS_CONCOMITANT]->(d:Drug {name: 'CLONAZEPAM'}) RETURN d.doseUnit`\n",
      "Cypher: `MATCH (d:Drug {name: 'VIMPAT'})-[:IS_PRIMARY_SUSPECT|IS_CONCOMITANT|IS_SECONDARY_SUSPECT]->(c:Case) RETURN c.primaryid`\n",
      "Cypher: `MATCH (c:Case {primaryid: 172652664}) RETURN c.eventDate`\n",
      "Cypher: `MATCH (c:Case {primaryid: 172652664}) RETURN c.gender`\n",
      "Cypher: `MATCH (m:Manufacturer)-[:REGISTERED]->(c:Case {primaryid: 172775763}) RETURN m.manufacturerName`\n",
      "Cypher: `MATCH (c:Case {primaryid: 172652664})-[:RESULTED_IN]->(o:Outcome) RETURN o.code`\n",
      "Cypher: `MATCH (c:Case {primaryid: 172775763}) RETURN c.reportDate`\n",
      "Cypher: `MATCH (d:Drug {name: 'REVLIMID'})-[:PRESCRIBED]->(t:Therapy) RETURN t.primaryid`\n"
     ]
    }
   ],
   "source": [
    "f = json.load(open('evaluation_query.json'))\n",
    "cnt = -1\n",
    "cypher_queries = []\n",
    "for i in f:\n",
    "    # print(i)\n",
    "    cnt += 1\n",
    "    if (cnt % 3 == 0):\n",
    "        print(i[\"question\"])\n",
    "        cypher_queries.append(i[\"question\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Cypher: ', 'MATCH (c:Case {primaryid: 10})-[:IS_PRIMARY_SUSPECT]->(d:Drug) RETURN d.name', '']\n",
      "['Cypher: ', 'MATCH (c:Case {primaryid: 107526832})-[:FALLS_UNDER]->(ag:AgeGroup) RETURN ag.ageGroup', '']\n",
      "['Cypher: ', 'MATCH (c:Case {primaryid: 109543792}) RETURN c.reporterOccupation', '']\n",
      "['Cypher: ', 'MATCH (c:Case {primaryid: 172775763})-[:RESULTED_IN]->(o:Outcome) RETURN o.outcome', '']\n",
      "['Cypher: ', 'MATCH (m:Manufacturer)-[:REGISTERED]->(c:Case {primaryid: 135402785}) RETURN m.manufacturerName', '']\n",
      "['Cypher: ', \"MATCH (c:Case {primaryid: 172775763})-[:IS_PRIMARY_SUSPECT]->(d:Drug {name: 'DEXAMETHASONE'}) RETURN d.doseAmount\", '']\n",
      "['Cypher: ', 'MATCH (d:Drug {id: 7160})-[:IS_SECONDARY_SUSPECT]->(c:Case) RETURN c.primaryid', '']\n",
      "['Cypher: ', \"MATCH (c:Case {primaryid: 1376832112})-[:IS_SECONDARY_SUSPECT]->(d:Drug {name: 'AFINITOR'}) RETURN d.route\", '']\n",
      "['Cypher: ', 'MATCH (c:Case {primaryid: 172652664}) RETURN c.age', '']\n",
      "['Cypher: ', 'MATCH (c:Case {primaryid: 172652664})-[:HAS_REACTION]->(r:Reaction) RETURN r.description', '']\n",
      "['Cypher: ', 'MATCH (c:Case {primaryid: 109705882})-[:RECEIVED]->(t:Therapy) RETURN t.primaryid', '']\n",
      "['Cypher: ', 'MATCH (c:Case {primaryid: 104833856})-[:REPORTED_BY]->(rs:ReportSource) RETURN rs.name', '']\n",
      "['Cypher: ', \"MATCH (c:Case {primaryid: 168021028})-[:IS_CONCOMITANT]->(d:Drug {name: 'CLONAZEPAM'}) RETURN d.doseUnit\", '']\n",
      "['Cypher: ', \"MATCH (d:Drug {name: 'VIMPAT'})-[:IS_PRIMARY_SUSPECT|IS_CONCOMITANT|IS_SECONDARY_SUSPECT]->(c:Case) RETURN c.primaryid\", '']\n",
      "['Cypher: ', 'MATCH (c:Case {primaryid: 172652664}) RETURN c.eventDate', '']\n",
      "['Cypher: ', 'MATCH (c:Case {primaryid: 172652664}) RETURN c.gender', '']\n",
      "['Cypher: ', 'MATCH (m:Manufacturer)-[:REGISTERED]->(c:Case {primaryid: 172775763}) RETURN m.manufacturerName', '']\n",
      "['Cypher: ', 'MATCH (c:Case {primaryid: 172652664})-[:RESULTED_IN]->(o:Outcome) RETURN o.code', '']\n",
      "['Cypher: ', 'MATCH (c:Case {primaryid: 172775763}) RETURN c.reportDate', '']\n",
      "['Cypher: ', \"MATCH (d:Drug {name: 'REVLIMID'})-[:PRESCRIBED]->(t:Therapy) RETURN t.primaryid\", '']\n",
      "['MATCH (c:Case {primaryid: 10})-[:IS_PRIMARY_SUSPECT]->(d:Drug) RETURN d.name', 'MATCH (c:Case {primaryid: 107526832})-[:FALLS_UNDER]->(ag:AgeGroup) RETURN ag.ageGroup', 'MATCH (c:Case {primaryid: 109543792}) RETURN c.reporterOccupation', 'MATCH (c:Case {primaryid: 172775763})-[:RESULTED_IN]->(o:Outcome) RETURN o.outcome', 'MATCH (m:Manufacturer)-[:REGISTERED]->(c:Case {primaryid: 135402785}) RETURN m.manufacturerName', \"MATCH (c:Case {primaryid: 172775763})-[:IS_PRIMARY_SUSPECT]->(d:Drug {name: 'DEXAMETHASONE'}) RETURN d.doseAmount\", 'MATCH (d:Drug {id: 7160})-[:IS_SECONDARY_SUSPECT]->(c:Case) RETURN c.primaryid', \"MATCH (c:Case {primaryid: 1376832112})-[:IS_SECONDARY_SUSPECT]->(d:Drug {name: 'AFINITOR'}) RETURN d.route\", 'MATCH (c:Case {primaryid: 172652664}) RETURN c.age', 'MATCH (c:Case {primaryid: 172652664})-[:HAS_REACTION]->(r:Reaction) RETURN r.description', 'MATCH (c:Case {primaryid: 109705882})-[:RECEIVED]->(t:Therapy) RETURN t.primaryid', 'MATCH (c:Case {primaryid: 104833856})-[:REPORTED_BY]->(rs:ReportSource) RETURN rs.name', \"MATCH (c:Case {primaryid: 168021028})-[:IS_CONCOMITANT]->(d:Drug {name: 'CLONAZEPAM'}) RETURN d.doseUnit\", \"MATCH (d:Drug {name: 'VIMPAT'})-[:IS_PRIMARY_SUSPECT|IS_CONCOMITANT|IS_SECONDARY_SUSPECT]->(c:Case) RETURN c.primaryid\", 'MATCH (c:Case {primaryid: 172652664}) RETURN c.eventDate', 'MATCH (c:Case {primaryid: 172652664}) RETURN c.gender', 'MATCH (m:Manufacturer)-[:REGISTERED]->(c:Case {primaryid: 172775763}) RETURN m.manufacturerName', 'MATCH (c:Case {primaryid: 172652664})-[:RESULTED_IN]->(o:Outcome) RETURN o.code', 'MATCH (c:Case {primaryid: 172775763}) RETURN c.reportDate', \"MATCH (d:Drug {name: 'REVLIMID'})-[:PRESCRIBED]->(t:Therapy) RETURN t.primaryid\"]\n"
     ]
    }
   ],
   "source": [
    "refined_queries = []\n",
    "\n",
    "def preprocess(query):\n",
    "    refined_query = \"\"\n",
    "    l = query.split(\"`\")\n",
    "    print(l)\n",
    "    refined_queries.append(l[1])\n",
    "    \n",
    "\n",
    "# print(cypher_queries[1:])\n",
    "\n",
    "for i in cypher_queries[1:]:\n",
    "    preprocess(i)\n",
    "#     preprocess(i[\"question\"])\n",
    "\n",
    "print(refined_queries)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "class Neo4jConnector:\n",
    "    def __init__(self, config: Config):\n",
    "        self.driver = GraphDatabase.driver(\n",
    "            config.neo4j_uri,\n",
    "            auth=(config.neo4j_user, config.neo4j_password)\n",
    "        )\n",
    "        self.database = config.database\n",
    "        \n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "        \n",
    "    def __enter__(self):\n",
    "        return self\n",
    "        \n",
    "    def __exit__(self, exc_type, exc_val, exc_tb):\n",
    "        self.close()\n",
    "        \n",
    "    def fetch_schema(self) -> Dict:\n",
    "        \"\"\"Fetch and return the database schema\"\"\"\n",
    "        with self.driver.session(database=self.database) as session:\n",
    "            result = session.run(\"CALL db.schema.visualization()\")\n",
    "            record = result.single()\n",
    "            print(\"========================= SCHEMA GEN ========================\")\n",
    "            print(record)\n",
    "            return {\n",
    "                \"nodes\": record[\"nodes\"],\n",
    "                \"relationships\": record[\"relationships\"]\n",
    "            }\n",
    "            \n",
    "    def fetch_sample_values(self, limit: int = 5) -> List:\n",
    "        \"\"\"Fetch sample values from the database\"\"\"\n",
    "        with self.driver.session(database=self.database) as session:\n",
    "            query = \"\"\"\n",
    "            MATCH (n)\n",
    "            WHERE rand() > 0.6\n",
    "            RETURN n\n",
    "            LIMIT $limit\n",
    "            \"\"\"\n",
    "            result = session.run(query, limit=limit)\n",
    "            return [record[\"n\"] for record in result]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [],
   "source": [
    "URI = \"neo4j+s://4017a08b.databases.neo4j.io\"\n",
    "PWD = \"NMa5reBMrNMfIJvMFLKy6lsnKqYQR_q4EajPYzH8pQk\"\n",
    "# Initialize the Neo4j connector module\n",
    "graph = Neo4jGraph(url=URI, username='neo4j', password=PWD, database='neo4j')\n",
    "\n",
    "# Module to extract data from the graph\n",
    "gutils = Neo4jSchema(url=URI, username='neo4j', password=PWD, database='neo4j')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'n': {'id': 142, 'ageGroup': 'Adult'}}, {'n': {'id': 143, 'ageGroup': 'Elderly'}}]\n"
     ]
    }
   ],
   "source": [
    "q = \"MATCH (n:AgeGroup) RETURN n LIMIT 2\"\n",
    "print(gutils.run_cypher(q))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Query:  MATCH (c:Case {primaryid: 10})-[:IS_PRIMARY_SUSPECT]->(d:Drug) RETURN d.name\n",
      "Results:  []\n",
      "Query:  MATCH (c:Case {primaryid: 107526832})-[:FALLS_UNDER]->(ag:AgeGroup) RETURN ag.ageGroup\n",
      "Results:  [{'ag.ageGroup': 'Elderly'}]\n",
      "Query:  MATCH (c:Case {primaryid: 109543792}) RETURN c.reporterOccupation\n",
      "Results:  [{'c.reporterOccupation': 'Hospital'}]\n",
      "Query:  MATCH (c:Case {primaryid: 172775763})-[:RESULTED_IN]->(o:Outcome) RETURN o.outcome\n",
      "Results:  [{'o.outcome': 'Hospitalization - Initial or Prolonged'}, {'o.outcome': 'Other Serious (Important Medical Event)'}, {'o.outcome': 'Life-Threatening'}]\n",
      "Query:  MATCH (m:Manufacturer)-[:REGISTERED]->(c:Case {primaryid: 135402785}) RETURN m.manufacturerName\n",
      "Results:  [{'m.manufacturerName': 'NOVARTIS'}]\n",
      "Query:  MATCH (c:Case {primaryid: 172775763})-[:IS_PRIMARY_SUSPECT]->(d:Drug {name: 'DEXAMETHASONE'}) RETURN d.doseAmount\n",
      "Results:  [{'d.doseAmount': None}]\n",
      "Query:  MATCH (d:Drug {id: 7160})-[:IS_SECONDARY_SUSPECT]->(c:Case) RETURN c.primaryid\n",
      "Results:  []\n",
      "Query:  MATCH (c:Case {primaryid: 1376832112})-[:IS_SECONDARY_SUSPECT]->(d:Drug {name: 'AFINITOR'}) RETURN d.route\n",
      "Results:  [{'d.route': None}]\n",
      "Query:  MATCH (c:Case {primaryid: 172652664}) RETURN c.age\n",
      "Results:  [{'c.age': 77.0}]\n",
      "Query:  MATCH (c:Case {primaryid: 172652664})-[:HAS_REACTION]->(r:Reaction) RETURN r.description\n",
      "Results:  [{'r.description': 'Pulmonary embolism'}, {'r.description': 'Nasopharyngitis'}, {'r.description': 'Incorrect drug administration rate'}, {'r.description': 'Body temperature abnormal'}]\n",
      "Query:  MATCH (c:Case {primaryid: 109705882})-[:RECEIVED]->(t:Therapy) RETURN t.primaryid\n",
      "Results:  [{'t.primaryid': 109705882}]\n",
      "Query:  MATCH (c:Case {primaryid: 104833856})-[:REPORTED_BY]->(rs:ReportSource) RETURN rs.name\n",
      "Results:  [{'rs.name': 'Health Professional'}]\n",
      "Query:  MATCH (c:Case {primaryid: 168021028})-[:IS_CONCOMITANT]->(d:Drug {name: 'CLONAZEPAM'}) RETURN d.doseUnit\n",
      "Results:  [{'d.doseUnit': None}]\n",
      "Query:  MATCH (d:Drug {name: 'VIMPAT'})-[:IS_PRIMARY_SUSPECT|IS_CONCOMITANT|IS_SECONDARY_SUSPECT]->(c:Case) RETURN c.primaryid\n",
      "Results:  []\n",
      "Query:  MATCH (c:Case {primaryid: 172652664}) RETURN c.eventDate\n",
      "Results:  [{'c.eventDate': neo4j.time.DateTime(2019, 12, 18, 0, 0, 0, 0, tzinfo=<UTC>)}]\n",
      "Query:  MATCH (c:Case {primaryid: 172652664}) RETURN c.gender\n",
      "Results:  [{'c.gender': 'F'}]\n",
      "Query:  MATCH (m:Manufacturer)-[:REGISTERED]->(c:Case {primaryid: 172775763}) RETURN m.manufacturerName\n",
      "Results:  [{'m.manufacturerName': 'HIKMA'}]\n",
      "Query:  MATCH (c:Case {primaryid: 172652664})-[:RESULTED_IN]->(o:Outcome) RETURN o.code\n",
      "Results:  [{'o.code': 'OT'}]\n",
      "Query:  MATCH (c:Case {primaryid: 172775763}) RETURN c.reportDate\n",
      "Results:  [{'c.reportDate': neo4j.time.DateTime(2021, 8, 26, 0, 0, 0, 0, tzinfo=<UTC>)}]\n",
      "Query:  MATCH (d:Drug {name: 'REVLIMID'})-[:PRESCRIBED]->(t:Therapy) RETURN t.primaryid\n",
      "Results:  []\n"
     ]
    }
   ],
   "source": [
    "for query in refined_queries: \n",
    "    print(\"Query: \", query)\n",
    "    print(\"Results: \", gutils.run_cypher(query))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
