[
  {
    "NL Question": "What is the version of the _Bloom_Perspective_ node with the name 'Contact Tracing'?",
    "Cypher": "MATCH (b:_Bloom_Perspective_ {name: 'Contact Tracing'}) RETURN b.version AS bloomPerspectiveVersion;",
    "source_dataset": "covid",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 193,
    "unique_id": "covid_data_3_2_2_6_Evaluation_query_193",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  },
  {
    "NL Question": "What is the end time of the visit with ID '3448'?",
    "Cypher": "MATCH (v:Visit {id: '3448'}) RETURN v.endtime AS visitEndTime;",
    "source_dataset": "covid",
    "source_chunk": "data_3_2_2_6",
    "original_file": "Evaluation_query.json",
    "original_index": 199,
    "unique_id": "covid_data_3_2_2_6_Evaluation_query_199",
    "pipeline_stage": "PASSED_ALL",
    "schema_validation": "✅ Query is valid according to schema!",
    "runtime_validation": "Passed",
    "neo4j_runtime_validation": "No runtime errors.",
    "neo4j_runtime_passed": 1,
    "neo4j_result_validation": "Results returned successfully.",
    "neo4j_result_passed": 1,
    "content_validation": "Results contain non-null, non-zero values.",
    "content_passed": 1,
    "value_validation": "✅ All values in Cypher are consistent with the NL question."
  }
]